Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresInfo.GetCopyRightText Method
 Returns the Tekla Structures copyright text as string.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static string GetCopyRightText()
Public Shared Function GetCopyRightText As String
Return Value
Type: String
The current copyright text of Tekla Structures.
See Also
Reference
TeklaStructuresInfo Class
Tekla.Structures Namespace